Revit 2026 API

# LevelAssociationFailures Properties

---

The BuiltInFailuresLevelAssociationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllLevelsDeleted | All Levels from model were deleted |

#### Reference

BuiltInFailuresLevelAssociationFailures Class

Autodesk.Revit.DB Namespace